ChibiOS/ChibiOS/os/hal/ports/STM32/STM32C0xx/hal_lld.h
/*
 * Configuration-related checks.
 */
#if !defined(STM32C0xx_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C0xx_MCUCONF not defined"
#endif

#if defined(STM32C011xx) && !defined(STM32C011_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C011_MCUCONF not defined"

#elif defined(STM32C031xx) && !defined(STM32C031_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32C031_MCUCONF not defined"

#endif

/*
 * Board files sanity checks.
 */
#if !defined(STM32_LSECLK)
#error "STM32_LSECLK not defined in board.h"
#endif

#if !defined(STM32_LSEDRV)
#error "STM32_LSEDRV not defined in board.h"
#endif

#if !defined(STM32_HSECLK)
#error "STM32_HSECLK not defined in board.h"
#endif

/**
 * @name    System Limits
 * @{
 */
#define STM32_SYSCLK_MAX                48000000
#define STM32_HSECLK_MAX                48000000
#define STM32_HSECLK_BYP_MAX            48000000
#define STM32_HSECLK_MIN                4000000
#define STM32_HSECLK_BYP_MIN            8000000
#define STM32_LSECLK_MAX                32768
#define STM32_LSECLK_BYP_MAX            1000000
#define STM32_LSECLK_MIN                32768
#define STM32_LSECLK_BYP_MIN            32768
#define STM32_PCLK_MAX                  48000000
#define STM32_ADCCLK_MAX                350000000

#define STM32_0WS_THRESHOLD             24000000
/** @} */

/* Clock handlers.*/
#include "stm32_lse_v3.inc"
#include "stm32_lsi_v3.inc"
#include "stm32_hsi48.inc"
#include "stm32_hse.inc"

/*
 * HSI48 related checks.
 */
#if STM32_RCC_HAS_HSI48
#if STM32_HSI48_ENABLED
#else /* !STM32_HSI48_ENABLED */

  #if STM32_SW == STM32_SW_HSISYS
    #error "HSI48 not enabled, required by STM32_SW"
  #endif

  #if STM32_MCOSEL == STM32_MCOSEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_HSI48
    #error "HSI48 not enabled, required by STM32_MCO2SEL"
  #endif

  #if (STM32_ADCSEL == STM32_ADCSEL_HSIKER)
    #error "HSI48 not enabled, required by STM32_ADCSEL"
  #endif

  #if (STM32_I2C1SEL == STM32_I2C1SEL_HSIKER)
    #error "HSI48 not enabled, required by STM32_I2C1SEL"
  #endif

  #if (STM32_USART1SEL == STM32_USART1SEL_HSIKER)
    #error "HSI48 not enabled, required by STM32_USART1SEL"
  #endif

#endif /* !STM32_HSI48_ENABLED */
#endif /* STM32_RCC_HAS_HSI48 */

/*
 * HSE related checks.
 */
#if STM32_HSE_ENABLED
#else /* !STM32_HSE_ENABLED */

  #if STM32_SW == STM32_SW_HSE
    #error "HSE not enabled, required by STM32_SW"
  #endif

  #if STM32_MCOSEL == STM32_MCOSEL_HSE
    #error "HSE not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_HSE
    #error "HSE not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_RTCSEL == STM32_RTCSEL_HSEDIV
    #error "HSE not enabled, required by STM32_RTCSEL"
  #endif

#endif /* !STM32_HSE_ENABLED */

/*
 * LSI related checks.
 */
#if STM32_LSI_ENABLED
#else /* !STM32_LSI_ENABLED */

  #if HAL_USE_RTC && (STM32_RTCSEL == STM32_RTCSEL_LSI)
    #error "LSI not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCOSEL == STM32_MCOSEL_LSI
    #error "LSI not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_LSI
    #error "LSI not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_LSCOSEL == STM32_LSCOSEL_LSI
    #error "LSI not enabled, required by STM32_LSCOSEL"
  #endif

#endif /* !STM32_LSI_ENABLED */

/*
 * LSE related checks.
 */
#if STM32_LSE_ENABLED
#else /* !STM32_LSE_ENABLED */

  #if STM32_RTCSEL == STM32_RTCSEL_LSE
    #error "LSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_MCOSEL == STM32_MCOSEL_LSE
    #error "LSE not enabled, required by STM32_MCOSEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_LSE
    #error "LSE not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_LSCOSEL == STM32_LSCOSEL_LSE
    #error "LSE not enabled, required by STM32_LSCOSEL"
  #endif

  #if (STM32_USART1SEL == STM32_USART1SEL_LSE)
    #error "LSE not enabled, required by STM32_USART1SEL"
  #endif

#endif /* !STM32_LSE_ENABLED */

/**
 * @brief   STM32_HSIDIV field.
 */
#if (STM32_HSIDIV_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_HSIDIV              STM32_HSIDIV_DIV1

#elif STM32_HSIDIV_VALUE == 2
  #define STM32_HSIDIV              STM32_HSIDIV_DIV2

#elif STM32_HSIDIV_VALUE == 4
  #define STM32_HSIDIV              STM32_HSIDIV_DIV4

#elif STM32_HSIDIV_VALUE == 8
  #define STM32_HSIDIV              STM32_HSIDIV_DIV8

#elif STM32_HSIDIV_VALUE == 16
  #define STM32_HSIDIV              STM32_HSIDIV_DIV16

#elif STM32_HSIDIV_VALUE == 32
  #define STM32_HSIDIV              STM32_HSIDIV_DIV32

#elif STM32_HSIDIV_VALUE == 64
  #define STM32_HSIDIV              STM32_HSIDIV_DIV64

#elif STM32_HSIDIV_VALUE == 128
  #define STM32_HSIDIV              STM32_HSIDIV_DIV128

#else
  #error "invalid STM32_HSIDIV_VALUE value specified"
#endif

/**
 * @brief   STM32_HSIKER field.
 */
#if (STM32_HSIKER_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_HSIKER              STM32_HSIKER_DIV1

#elif STM32_HSIKER_VALUE == 2
  #define STM32_HSIKER              STM32_HSIKER_DIV2

#elif STM32_HSIKER_VALUE == 3
  #define STM32_HSIKER              STM32_HSIKER_DIV3

#elif STM32_HSIKER_VALUE == 4
  #define STM32_HSIKER              STM32_HSIKER_DIV4

#elif STM32_HSIKER_VALUE == 5
  #define STM32_HSIKER              STM32_HSIKER_DIV5

#elif STM32_HSIKER_VALUE == 6
  #define STM32_HSIKER              STM32_HSIKER_DIV6

#elif STM32_HSIKER_VALUE == 7
  #define STM32_HSIKER              STM32_HSIKER_DIV7

#elif STM32_HSIKER_VALUE == 8
  #define STM32_HSIKER              STM32_HSIKER_DIV8

#else
  #error "invalid STM32_HSIKER_VALUE value specified"
#endif

/**
 * @brief   HSISYS clock frequency.
 */
#define STM32_HSISYSCLK             (STM32_HSI48CLK / STM32_HSIDIV_VALUE)

/**
 * @brief   HSIKER clock frequency.
 */
#define STM32_HSIKERCLK             (STM32_HSI48CLK / STM32_HSIKER_VALUE)

/**
 * @brief   System clock source.
 */
#if (STM32_SW == STM32_SW_HSISYS)
  #define STM32_SYSCLK              STM32_HSISYSCLK

#elif (STM32_SW == STM32_SW_HSE)
  #define STM32_SYSCLK              STM32_HSECLK

#elif (STM32_SW == STM32_SW_LSI)
  #define STM32_SYSCLK              STM32_LSICLK

#elif (STM32_SW == STM32_SW_LSE)
  #define STM32_SYSCLK              STM32_LSECLK

#else
#error "invalid STM32_SW value specified"
#endif

/* Bus handlers.*/
#include "stm32_ahb.inc"
#include "stm32_apb.inc"

